report.example/oltp_write_only_32threads.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 32 tps: 18870.85 qps: 113321.96 (r/w/o: 0.00/75551.31/37770.66) lat (ms,95%): 3.36 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 32 tps: 18670.41 qps: 112015.48 (r/w/o: 0.00/74678.66/37336.83) lat (ms,95%): 3.30 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 32 tps: 18924.13 qps: 113528.80 (r/w/o: 0.00/75679.53/37849.27) lat (ms,95%): 3.36 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 32 tps: 19240.13 qps: 115475.81 (r/w/o: 0.00/76991.54/38484.27) lat (ms,95%): 3.30 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 32 tps: 18890.05 qps: 113332.29 (r/w/o: 0.00/75558.20/37774.10) lat (ms,95%): 3.25 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 32 tps: 18956.91 qps: 113721.45 (r/w/o: 0.00/75802.63/37918.82) lat (ms,95%): 3.30 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 32 tps: 19130.09 qps: 114803.54 (r/w/o: 0.00/76543.36/38260.18) lat (ms,95%): 3.19 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 32 tps: 18683.01 qps: 112107.06 (r/w/o: 0.00/74743.04/37364.02) lat (ms,95%): 3.30 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 32 tps: 19128.02 qps: 114754.10 (r/w/o: 0.00/76497.06/38257.03) lat (ms,95%): 3.19 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 32 tps: 18987.01 qps: 113911.03 (r/w/o: 0.00/75936.02/37975.01) lat (ms,95%): 3.25 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 32 tps: 19140.94 qps: 114864.64 (r/w/o: 0.00/76580.76/38283.88) lat (ms,95%): 2.97 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 32 tps: 19229.06 qps: 115355.38 (r/w/o: 0.00/76899.25/38456.13) lat (ms,95%): 3.19 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 32 tps: 19491.74 qps: 116997.43 (r/w/o: 0.00/78011.95/38985.48) lat (ms,95%): 3.02 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 32 tps: 19109.20 qps: 114623.23 (r/w/o: 0.00/76406.82/38216.41) lat (ms,95%): 3.07 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 32 tps: 19124.00 qps: 114748.02 (r/w/o: 0.00/76500.01/38248.01) lat (ms,95%): 3.30 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 32 tps: 18902.95 qps: 113404.71 (r/w/o: 0.00/75600.80/37803.90) lat (ms,95%): 3.30 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 32 tps: 19329.07 qps: 116008.40 (r/w/o: 0.00/77346.26/38662.13) lat (ms,95%): 3.07 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 32 tps: 18833.89 qps: 112965.36 (r/w/o: 0.00/75301.58/37663.79) lat (ms,95%): 3.25 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 32 tps: 19365.14 qps: 116203.82 (r/w/o: 0.00/77471.54/38732.27) lat (ms,95%): 2.97 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 32 tps: 19110.01 qps: 114646.04 (r/w/o: 0.00/76426.03/38220.01) lat (ms,95%): 3.13 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 32 tps: 19041.98 qps: 114264.86 (r/w/o: 0.00/76179.90/38084.95) lat (ms,95%): 3.19 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 32 tps: 19180.04 qps: 115119.26 (r/w/o: 0.00/76757.17/38362.09) lat (ms,95%): 3.07 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 32 tps: 18638.67 qps: 111796.04 (r/w/o: 0.00/74519.70/37276.35) lat (ms,95%): 3.19 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 32 tps: 19129.13 qps: 114780.77 (r/w/o: 0.00/76525.52/38255.26) lat (ms,95%): 3.13 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 32 tps: 18851.13 qps: 113131.75 (r/w/o: 0.00/75426.50/37705.25) lat (ms,95%): 3.25 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 32 tps: 19070.03 qps: 114412.21 (r/w/o: 0.00/76272.14/38140.07) lat (ms,95%): 3.19 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 32 tps: 19074.01 qps: 114406.08 (r/w/o: 0.00/76265.05/38141.03) lat (ms,95%): 3.25 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 32 tps: 18979.01 qps: 113863.07 (r/w/o: 0.00/75905.05/37958.02) lat (ms,95%): 3.19 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 32 tps: 18928.96 qps: 113591.75 (r/w/o: 0.00/75730.83/37860.92) lat (ms,95%): 3.13 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 32 tps: 19304.70 qps: 115842.21 (r/w/o: 0.00/77231.81/38610.40) lat (ms,95%): 3.13 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           2285472
        other:                           1142736
        total:                           3428208
    transactions:                        571368 (19042.97 per sec.)
    queries:                             3428208 (114257.84 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          30.0031s
    total number of events:              571368

Latency (ms):
         min:                                    0.29
         avg:                                    1.68
         max:                                   26.00
         95th percentile:                        3.19
         sum:                               959780.67

Threads fairness:
    events (avg/stddev):           17855.2500/638.66
    execution time (avg/stddev):   29.9931/0.00