report.example/oltp_write_only_64threads.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 64
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 64 tps: 19469.34 qps: 116995.85 (r/w/o: 0.00/78005.22/38990.63) lat (ms,95%): 7.56 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 64 tps: 19769.22 qps: 118610.34 (r/w/o: 0.00/79069.89/39540.45) lat (ms,95%): 7.04 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 64 tps: 19272.17 qps: 115730.05 (r/w/o: 0.00/77177.70/38552.35) lat (ms,95%): 7.70 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 64 tps: 19634.92 qps: 117765.50 (r/w/o: 0.00/78502.66/39262.83) lat (ms,95%): 6.79 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 64 tps: 19658.11 qps: 117992.67 (r/w/o: 0.00/78672.45/39320.22) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 64 tps: 19644.97 qps: 117854.82 (r/w/o: 0.00/78564.88/39289.94) lat (ms,95%): 7.70 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 64 tps: 19092.08 qps: 114537.51 (r/w/o: 0.00/76353.34/38184.17) lat (ms,95%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 64 tps: 19796.96 qps: 118723.78 (r/w/o: 0.00/79132.85/39590.93) lat (ms,95%): 7.56 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 64 tps: 19373.93 qps: 116302.56 (r/w/o: 0.00/77551.70/38750.85) lat (ms,95%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 64 tps: 18870.06 qps: 113253.35 (r/w/o: 0.00/75514.24/37739.12) lat (ms,95%): 7.84 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 64 tps: 19500.05 qps: 116990.30 (r/w/o: 0.00/77987.20/39003.10) lat (ms,95%): 7.84 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 64 tps: 19430.72 qps: 116539.32 (r/w/o: 0.00/77683.88/38855.44) lat (ms,95%): 7.70 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 64 tps: 19304.01 qps: 115870.06 (r/w/o: 0.00/77258.04/38612.02) lat (ms,95%): 7.56 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 64 tps: 19088.11 qps: 114570.65 (r/w/o: 0.00/76389.43/38181.22) lat (ms,95%): 7.84 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 64 tps: 19361.09 qps: 116052.55 (r/w/o: 0.00/77337.37/38715.18) lat (ms,95%): 7.70 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 64 tps: 19438.02 qps: 116715.12 (r/w/o: 0.00/77833.08/38882.04) lat (ms,95%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 64 tps: 19148.01 qps: 114772.04 (r/w/o: 0.00/76486.02/38286.01) lat (ms,95%): 7.70 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 64 tps: 19140.95 qps: 114895.71 (r/w/o: 0.00/76611.81/38283.90) lat (ms,95%): 7.56 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 64 tps: 19647.94 qps: 117882.62 (r/w/o: 0.00/78584.74/39297.87) lat (ms,95%): 6.79 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 64 tps: 19699.12 qps: 118159.72 (r/w/o: 0.00/78762.48/39397.24) lat (ms,95%): 7.04 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 64 tps: 19679.86 qps: 118104.18 (r/w/o: 0.00/78742.46/39361.73) lat (ms,95%): 7.17 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 64 tps: 19759.13 qps: 118586.77 (r/w/o: 0.00/79067.52/39519.26) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 64 tps: 19742.90 qps: 118492.42 (r/w/o: 0.00/79004.61/39487.81) lat (ms,95%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 64 tps: 19490.00 qps: 116923.97 (r/w/o: 0.00/77944.98/38978.99) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 64 tps: 19224.07 qps: 115310.40 (r/w/o: 0.00/76867.27/38443.13) lat (ms,95%): 7.84 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 64 tps: 19531.06 qps: 117152.36 (r/w/o: 0.00/78094.24/39058.12) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 64 tps: 19660.98 qps: 118013.90 (r/w/o: 0.00/78680.94/39332.97) lat (ms,95%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 64 tps: 18992.99 qps: 113974.92 (r/w/o: 0.00/75985.95/37988.97) lat (ms,95%): 7.84 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 64 tps: 18995.82 qps: 113982.94 (r/w/o: 0.00/75998.29/37984.65) lat (ms,95%): 7.84 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 64 tps: 19614.30 qps: 117579.77 (r/w/o: 0.00/78356.18/39223.59) lat (ms,95%): 6.91 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           2332456
        other:                           1166228
        total:                           3498684
    transactions:                        583114 (19431.13 per sec.)
    queries:                             3498684 (116586.78 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          30.0082s
    total number of events:              583114

Latency (ms):
         min:                                    0.26
         avg:                                    3.29
         max:                                   31.73
         95th percentile:                        7.43
         sum:                              1920004.07

Threads fairness:
    events (avg/stddev):           9111.1562/326.57
    execution time (avg/stddev):   30.0001/0.00