report.example/oltp_write_only_8threads.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 8 tps: 14046.87 qps: 84308.16 (r/w/o: 0.00/56206.44/28101.72) lat (ms,95%): 0.84 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 8 tps: 14102.01 qps: 84597.08 (r/w/o: 0.00/56394.05/28203.03) lat (ms,95%): 0.81 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 8 tps: 14177.88 qps: 85089.27 (r/w/o: 0.00/56732.51/28356.76) lat (ms,95%): 0.83 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 8 tps: 13890.24 qps: 83327.44 (r/w/o: 0.00/55547.96/27779.48) lat (ms,95%): 0.83 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 8 tps: 14260.98 qps: 85568.89 (r/w/o: 0.00/57045.93/28522.96) lat (ms,95%): 0.81 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 8 tps: 14077.03 qps: 84459.16 (r/w/o: 0.00/56306.11/28153.05) lat (ms,95%): 0.83 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 8 tps: 14206.99 qps: 85240.94 (r/w/o: 0.00/56826.96/28413.98) lat (ms,95%): 0.81 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 8 tps: 14035.07 qps: 84208.43 (r/w/o: 0.00/56138.28/28070.14) lat (ms,95%): 0.83 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 8 tps: 13947.95 qps: 83693.70 (r/w/o: 0.00/55796.80/27896.90) lat (ms,95%): 0.84 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 8 tps: 13906.01 qps: 83438.04 (r/w/o: 0.00/55626.03/27812.01) lat (ms,95%): 0.84 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 8 tps: 14047.94 qps: 84290.62 (r/w/o: 0.00/56194.75/28095.87) lat (ms,95%): 0.83 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 8 tps: 14298.04 qps: 85772.27 (r/w/o: 0.00/57179.18/28593.09) lat (ms,95%): 0.81 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 8 tps: 14019.83 qps: 84132.97 (r/w/o: 0.00/56090.32/28042.66) lat (ms,95%): 0.83 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 8 tps: 13894.36 qps: 83361.18 (r/w/o: 0.00/55572.46/27788.73) lat (ms,95%): 0.83 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 8 tps: 14211.80 qps: 85276.78 (r/w/o: 0.00/56853.18/28423.59) lat (ms,95%): 0.83 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 8 tps: 14196.03 qps: 85186.19 (r/w/o: 0.00/56794.13/28392.06) lat (ms,95%): 0.80 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 8 tps: 14195.09 qps: 85156.51 (r/w/o: 0.00/56766.34/28390.17) lat (ms,95%): 0.80 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 8 tps: 14167.99 qps: 85015.95 (r/w/o: 0.00/56679.97/28335.98) lat (ms,95%): 0.81 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 8 tps: 13848.00 qps: 83075.98 (r/w/o: 0.00/55380.98/27694.99) lat (ms,95%): 0.84 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 14327.99 qps: 85983.95 (r/w/o: 0.00/57326.96/28656.98) lat (ms,95%): 0.81 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 8 tps: 14245.86 qps: 85459.18 (r/w/o: 0.00/56967.46/28491.73) lat (ms,95%): 0.78 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 8 tps: 14004.16 qps: 84041.96 (r/w/o: 0.00/56033.64/28008.32) lat (ms,95%): 0.81 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 8 tps: 14190.97 qps: 85133.85 (r/w/o: 0.00/56751.90/28381.95) lat (ms,95%): 0.83 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 8 tps: 14205.20 qps: 85229.23 (r/w/o: 0.00/56818.82/28410.41) lat (ms,95%): 0.81 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 8 tps: 14162.74 qps: 84969.46 (r/w/o: 0.00/56646.97/28322.49) lat (ms,95%): 0.81 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 8 tps: 14248.92 qps: 85512.52 (r/w/o: 0.00/57011.68/28500.84) lat (ms,95%): 0.80 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 8 tps: 14143.13 qps: 84850.77 (r/w/o: 0.00/56564.51/28286.26) lat (ms,95%): 0.81 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 8 tps: 14154.01 qps: 84935.03 (r/w/o: 0.00/56627.02/28308.01) lat (ms,95%): 0.83 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 8 tps: 14161.01 qps: 84961.08 (r/w/o: 0.00/56639.05/28322.03) lat (ms,95%): 0.83 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 14102.00 qps: 84598.02 (r/w/o: 0.00/56395.01/28203.01) lat (ms,95%): 0.83 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           1694000
        other:                           847000
        total:                           2541000
    transactions:                        423500 (14115.44 per sec.)
    queries:                             2541000 (84692.65 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          30.0015s
    total number of events:              423500

Latency (ms):
         min:                                    0.28
         avg:                                    0.57
         max:                                   21.66
         95th percentile:                        0.83
         sum:                               239845.05

Threads fairness:
    events (avg/stddev):           52937.5000/1637.78
    execution time (avg/stddev):   29.9806/0.00